<?php
/**
 * Created by PhpStorm.
 * User: jiangtaiping
 * Date: 2017/4/5
 * Time: 11:17
 * 返回码对应说明
 */
$_config ['message_code'] = array(
    /**
     * 基本返回码
     */
    200 => '请求成功',
    301 => '即将跳转',
    500 => '请求失败',
    /**
     * 数据安全验证类返回码
     */
    110 => '参数验证失败', //ts过期
    111 => '参数验证失败', //hash字段不存在
    112 => '参数验证失败', //真的验证失败
    113 => '参数验证失败', //访问IP非法
    /**
     * 数据接口返回码
     */
    310 => 'TOKEN格式错误',
    311 => 'TOKEN错误',
    501 => '',
    502 => '',
    503 => '',
    504 => '',
    505 => '支付订单生成失败,请稍候再试!',
    512 => 'IP失效',
    513 => '二维码生成失败',
);